# print문 하나만 써서 다음을 출력하여라
#1234
#4321

# 123123123을 출력하여라 곱셈)

# type(4/2) ?

# 340001.2를 실수표현으로 나타내여라 e 사용

# 복소수 관련 3개를 나타내어라

# 두수의 몫, 나머지를 한번에 구해주는 함수를 사용하여 두 변수에 두값을 한번에 저장하여라

# a를 b로 나누었을때 그 몫을 넘지 않는 가장 큰 정수를 구하는 연산자를 사용하여라

# 2**1**3의 값을 적으시오(지수승 연산자는 어느방향으로 계산되는가?)

# -2**2 의 값은?

# _(언더스코어)가 무엇인가?

# eval()이 무엇인가?

# print(eval('"java"*3')) : >?

# 파이썬의 키워드를 출력하여라

# 같은 값을 한번에 여러 변수에 대입하여라

# 간단하게 두변수의값을 서로 바꾸어라.

# input()으로 받아들인 값의 type은 무엇인가

# str() 의 인풋값과 아웃풋값의 형태는?

# int()의 인풋값과 아웃풋값의 형태는 ?

# float() 의 인풋값과 아웃풋값의 형태는

# int("3.123")은 가능한가?

# float("3")은 가능한가?

# int(float('3.123123')) 은 가능한가?

# print(0b11) 값은?

# print(n진법의 수) 는 어떤 진법기수로 출력이되는가?

# bin()의 입력 형태와 아웃풋의 형태는?
 # 인풋의 형태와 진법기수

 # 아웃풋의 형태와 진법 기수

# oct()의 입력 형태와 아웃풋의 형태는?
 # 인풋의 형태와 진법기수

 # 아웃풋의 형태와 진법 기수

# hex()의 입력 형태와 아웃풋의 형태는?
 # 인풋의 형태와 진법기수

 # 아웃풋의 형태와 진법 기수

# 출력값이 str()인것은? str(),int(),float(),bin(),oct(),hex()

# 인풋값이 str()형태가 가능한것은? str(),int(),float(),bin(),oct(),hex()

# int('strnum', n=진법기수)
 # n이 0일 경우

 # n=2

 # n=8

 # n=16

 # n=10

# # 다음 프로그램을 만들어보시오
# 첫째로 어떤 진법기수로 입력할것인지 숫자 입력
# 둘째로 첫째의 진법기수로 수 입력
# 그수를 각각 2,8,16,10진법의 수로 출력하시오