## 학습개요
# 문자열
# - 객체와 클래스
# - 문자열길이, 첨자 활용indexing
# - 슬라이싱

# 문자함수
# -chr(), ord()

# 문자표현
# - 이스케이스 시퀀스
# 내장함수
# - min(), max()

# 문자열의 길이를 알아내기
# 첨자로 하나의 문자를 참조하기
# 부분 문자열을 참조하기
# 문자의 코드번호를, 코드로 문자를 알기
# 내장함수 min, max활용하기



# 2
# 메소드 str.replace(a,b)
 # - a 가 나타나는 모든 부분을 b로 모두 바꾼 문자열을 반환

# count(), join()
 # - 부분 문자열 출현 횟수
 # - 문자열의 문자사이사이에 원하는 문자열을 삽입

# find(), index()
# 문자열 찾기

# 메소드 split()
# 문자열을 여러 문자열로 나

# center() strip()
# 폭을 지정, 중앙에 문자열 배치
# 문자열 앞뒤의 특정문자들을 제거

# 메소드 format()
# 간결한 출력 처리
